bench_bnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "newUser"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WK6WoPPKVUfyN2Qzj_6PKg"], ["updated_at", "2018-10-05 21:55:25.816333"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!